cask_args appdir: "/Applications"

# Tap
tap "arl/arl"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# System
brew "python@3.11"
brew "autojump"
brew "bat"
brew "broot"
brew "coreutils"
brew "curl"
brew "deno"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "git"
brew "gitmux"
brew "gnupg"
brew "grep"
brew "hstr"
brew "imagemagick"
brew "lnav"
brew "thefuck"
brew "tmux"
brew "wget"
brew "zsh"

# Application
cask "alacritty"
cask "authy"
cask "binance"
cask "boom-3d"
cask "contexts"
cask "discord"
cask "font-hack-nerd-font"
cask "meetingbar"
cask "microsoft-edge"
cask "mos"
cask "notion"
cask "openkey"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

# mas "Dashlane", id: 517914548
# mas "Hotspot Shield", id: 771076721
# mas "Messenger", id: 1480068668
# mas "Xcode", id: 497799835
